# str(строка, саптар)
# строка в Python- это набор символов, окруженных одинарными, двойными или тройными кавычками.

# строка бул тамга ыраатуулугу жана ал тырмакчанын ичинде жазылган топтом.



# print(""" 
#       *
#      ***
#     *****
#    *******
#   *********
#      |||
    
#       """)

# print('Здравствуйте, добро пожаловать в наш банк')

# while True:
#     user = input("""Какую операцию хотите выбрать?
#     (Банкомат, Кредит, Карта): """)

#     if user == 'Банкомат':
#         a = int(input('Введите сумму: '))
#         if a < 200:
#             print('Минимальная сумма 200 сомов')
#         elif a > 25000:
#             print('Максимальная сумма 25000 сомов')
#         else:
#             print('Операция успешно выполнена. Вы сняли деньги.')
    
#     elif user == 'Кредит':
#         last_name = input('Введите вашу фамилию: ')
#         first_name = input('Введите ваше имя: ')
#         credit_amount = int(input('Введите сумму кредита: '))
        
#         if credit_amount < 20000:
#             print('Минимальная сумма кредита 20 000 сомов')
#         elif credit_amount > 100000:
#             print('Максимальная сумма кредита 100 000 сомов')
#         else:
#             print(f'Кредит на сумму {credit_amount} сомов оформлен на имя {last_name} {first_name}.')
    
#     elif user == 'Карта':
#         last_name = input('Введите вашу фамилию: ')
#         first_name = input('Введите ваше имя: ')
#         print(f'Вы выбрали операцию "Карта". Карта будет выпущена на имя {last_name} {first_name}.')
    
#     else:
#         print('Неверная операция, попробуйте снова.')









